Revit 2024 API
AlignmentStationLabel.AlignmentId Property
 The ElementId of the Alignment on which the SpotDimension is placed.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public ElementId AlignmentId { get; }
Visual Basic
Public ReadOnly Property AlignmentId As ElementId
	Get
Visual C++
public:
property ElementId^ AlignmentId {
	ElementId^ get ();
}
See Also
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace